In [2]:
import numpy as np
import pandas as pd
from mysql.connector import connect

In [3]:
df = pd.read_csv('drinks.csv')

In [4]:
df.shape

(193, 7)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 7 columns):
Unnamed: 0                      193 non-null int64
country                         193 non-null object
beer_servings                   193 non-null int64
spirit_servings                 193 non-null int64
wine_servings                   193 non-null int64
total_litres_of_pure_alcohol    193 non-null float64
continent                       170 non-null object
dtypes: float64(1), int64(4), object(2)
memory usage: 10.6+ KB

In [6]:
df.rename(columns={'Unnamed: 0':'id'}, inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 7 columns):
id                              193 non-null int64
country                         193 non-null object
beer_servings                   193 non-null int64
spirit_servings                 193 non-null int64
wine_servings                   193 non-null int64
total_litres_of_pure_alcohol    193 non-null float64
continent                       170 non-null object
dtypes: float64(1), int64(4), object(2)
memory usage: 10.6+ KB

In [7]:
df = df.astype({'id':'int32','beer_servings': 'int32','spirit_servings': 'int32','wine_servings': 'int32','total_litres_of_pure_alcohol': 'float32'})

In [8]:
df.dtypes

id                                int32
country                          object
beer_servings                     int32
spirit_servings                   int32
wine_servings                     int32
total_litres_of_pure_alcohol    float32
continent                        object
dtype: object

In [9]:
df.head()

,id,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,0,Afghanistan,0,0,0,0.0,AS
1,1,Albania,89,132,54,4.9,EU
2,2,Algeria,25,0,14,0.7,AF
3,3,Andorra,245,138,312,12.4,EU
4,4,Angola,217,57,45,5.9,AF

In [9]:
# df[df['country'].str.contains("'")]

In [10]:
conn = connect(host='172.24.40.247', port=3306, database='testdb', user='hv', password='123456')

In [11]:
cur = conn.cursor()

In [12]:
sql = 'delete from drinks'
cur.execute(sql)
conn.commit()

In [13]:
# cach 1
for i in range(len(df)): 
    sql = 'insert into drinks(id,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent)'
    sql += ' values({0},"{1}",{2},{3},{4},{5},"{6}");'.format(df.iloc[i, 0], df.iloc[i, 1], df.iloc[i, 2], df.iloc[i, 3], df.iloc[i, 4], df.iloc[i, 5], df.iloc[i, 6])
    cur.execute(sql)
conn.commit()

In [14]:
df['continent'].isnull().sum()

23

In [15]:
df[df['continent'].isnull()]

,id,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
5,5,Antigua & Barbuda,102,128,45,4.9,NaN
11,11,Bahamas,122,176,51,6.3,NaN
14,14,Barbados,143,173,36,6.3,NaN
17,17,Belize,263,114,8,6.8,NaN
32,32,Canada,240,122,100,8.2,NaN
41,41,Costa Rica,149,87,11,4.4,NaN
43,43,Cuba,93,137,5,4.2,NaN
50,50,Dominica,52,286,26,6.6,NaN
51,51,Dominican Republic,193,147,9,6.2,NaN
54,54,El Salvador,52,69,2,2.2,NaN
68,68,Grenada,199,438,28,11.9,NaN
69,69,Guatemala,53,69,2,2.2,NaN
73,73,Haiti,1,326,1,5.9,NaN
74,74,Honduras,69,98,2,3.0,NaN
84,84,Jamaica,82,97,9,3.4,NaN
109,109,Mexico,238,68,5,5.5,NaN
122,122,Nicaragua,78,118,1,3.5,NaN
130,130,Panama,285,104,18,7.2,NaN
143,143,St. Kitts & Nevis,194,205,32,7.7,NaN
144,144,St. Lucia,171,315,71,10.1,NaN
145,145,St. Vincent & the Grenadines,120,221,11,6.3,NaN
174,174,Trinidad & Tobago,197,156,7,6.4,NaN
184,184,USA,249,158,84,8.7,NaN

In [17]:
sql = 'update drinks set continent=NULL where continent=\'nan\''
cur.execute(sql)
conn.commit()

In [18]:
cur.close()

True

In [19]:
conn.close()

In [20]:
conn = connect(host='172.24.40.247', port=3306, database='testdb', user='hv', password='123456')

In [21]:
cur = conn.cursor()

In [28]:
df.fillna('', inplace=True) # null (np.nan) thay bang empty

In [30]:
data = df.to_dict('records') # data la bien list chua cac dictionary
data[0:5]

[{'id': 0,
  'country': 'Afghanistan',
  'beer_servings': 0,
  'spirit_servings': 0,
  'wine_servings': 0,
  'total_litres_of_pure_alcohol': 0.0,
  'continent': 'AS'},
 {'id': 1,
  'country': 'Albania',
  'beer_servings': 89,
  'spirit_servings': 132,
  'wine_servings': 54,
  'total_litres_of_pure_alcohol': 4.900000095367432,
  'continent': 'EU'},
 {'id': 2,
  'country': 'Algeria',
  'beer_servings': 25,
  'spirit_servings': 0,
  'wine_servings': 14,
  'total_litres_of_pure_alcohol': 0.699999988079071,
  'continent': 'AF'},
 {'id': 3,
  'country': 'Andorra',
  'beer_servings': 245,
  'spirit_servings': 138,
  'wine_servings': 312,
  'total_litres_of_pure_alcohol': 12.399999618530273,
  'continent': 'EU'},
 {'id': 4,
  'country': 'Angola',
  'beer_servings': 217,
  'spirit_servings': 57,
  'wine_servings': 45,
  'total_litres_of_pure_alcohol': 5.900000095367432,
  'continent': 'AF'}]

In [24]:
sql = 'delete from drinks'
cur.execute(sql)
conn.commit()

In [31]:
# cach 2
sql = 'insert into drinks(id,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent)'
sql += ' values(%(id)s,%(country)s,%(beer_servings)s,%(spirit_servings)s,%(wine_servings)s,%(total_litres_of_pure_alcohol)s,%(continent)s)'
cur.executemany(sql, data)
conn.commit()